# zsh関係
brew 'zsh'

# iOS
brew "xcodegen"
brew 'mint'

# Flutter
brew 'usbmuxd'
brew "libimobiledevice", args: ["HEAD"]
brew 'ideviceinstaller'
brew 'ios-deploy'

# プログラミング言語
tap 'dart-lang/dart'
brew 'go'
brew 'dart'

# ツール
brew 'ag'
brew 'gh'
brew 'ghq'
brew 'fzf'
brew 'jq'
brew 'tig'
brew 'tree'
brew 'nkf'
brew 'git'
brew 'emojify'
brew 'nvim'
brew 'tmux'
brew 'starship'
brew 'n'
brew 'asdf'

# gPRC
brew 'protobuf'

# ruby-build
brew 'openssl@3'
brew 'readline'
brew 'libyaml'
brew 'autoconf'
brew 'gmp'

# Cask
cask 'clipy'
cask 'raycast'
cask 'font-hack-nerd-font'
cask 'warp'
cask 'notion'
cask 'notion-calendar'
cask 'figma'
cask 'discord'
cask 'rectangle'
