# zsh関係
brew 'zsh'

# env系
brew 'rbenv'
brew 'pyenv'
brew 'nodebrew'

# iOS
tap 'robotsandpencils/made'
brew 'carthage'
brew "xcodegen"
brew 'mint'
brew 'robotsandpencils/made/xcodes'

# Flutter
brew 'usbmuxd'
brew "libimobiledevice", args: ["HEAD"]
brew 'ideviceinstaller'
brew 'ios-deploy'

# プログラミング言語
tap 'dart-lang/dart'
brew 'go'
brew 'dart'

# ツール
brew 'ag'
brew 'gh'
brew 'ghq'
brew 'fzf'
brew 'jq'
brew 'tig'
brew 'tree'
brew 'nkf'
brew 'git'
brew 'emojify'
brew 'nvim'
brew 'tmux'
brew 'starship'

# gPRC
brew 'protobuf'

# Cask
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
cask 'clipy'
cask 'karabiner-elements'
cask 'alfred'
cask 'font-hack-nerd-font'
