# zsh関係
brew 'zsh'
brew 'zplug'

# env系
brew 'rbenv'
brew 'pyenv'
brew 'nodebrew'
brew 'kylef/formulae/swiftenv'

# iOS
brew 'carthage'
brew "xcodegen"
brew 'mint'

# Flutter
brew 'usbmuxd'
brew "libimobiledevice", args: ["HEAD"]
brew 'ideviceinstaller'
brew 'ios-deploy'

# プログラミング言語
brew 'go'
tap "dart-lang/dart"
brew 'dart'
brew 'rustup'
brew 'elm'

# Web Front
brew 'yarn'

# ツール
brew 'gh'
brew 'ghq'
brew 'fzf'
brew 'jq'
brew 'gibo'
brew 'tig'
brew 'tree'
brew 'nkf'
brew 'git'
brew 'emojify'
brew 'mysql'
brew 'nvim'
brew 'poetry'

# gPRC
brew 'protobuf'

# tap and install mas to use `cask` and `mas`
tap 'homebrew/cask'
brew 'mas'

# Cask
tap 'homebrew/cask-drivers'
cask "qmk-toolbox"
cask 'clipy'
cask 'shiftIt'
cask 'karabiner-elements'
cask 'alfred'
cask 'visual-studio-code'

# MacOS App
mas "DevCleaner", id: 1388020431
mas "Keynote", id: 409183694
mas "Realm Browser", id: 1007457278
mas "Slack", id: 803453959
mas "TweetDeck", id: 485812721
